# Час
tгод = 1 # Одна година
print("t =", tгод, "годин") # Візуалізація годин
Час = {"tгод" : tгод,}
print("Все відбувається за 1 секунду")

# Сонце
Gсонце = 1 # Вхідна потужність сонця 0 - 1.1 кВт   День , Ясно : 1,1;  Ніч , Пасмурно : 0
k = 0.5 # Тип сонячного колектора 0.1 - 0.9
print("Тип сонячного колектора (0.1 - 0.9) k =", k) # Візуалізація типу сонячного колектора
dGсонце = k * Gсонце # кВт
print("Потужності сонця на поверхні сонячного колектора Gсонце =", Gсонце, "кВт") # Візуалізація потужності сонця на поверхні сонячної системи кВт
dEсонце = dGсонце * tгод / 3600 # кВт * год  за 1 с
Сонце = {"Gсонце" : Gсонце,}


# Атмосфера
Tатмосфера = 25 # Температура атмосфери, стартова ідеальна нульова 20С , діапазон -35С / +95C   Зима : -35;  Літо : +95
print("Tатмосфера =", Tатмосфера, "градусів С") # Візуалізація температури атмосфери

# Колектор
# c - питома теплоємність води 4186,8 Дж/(кг·°C)
# 1 л води= 1 кг води
# 1 Дж = 1 Вт*с
# c води 4186,8 / 1000 / 3600 = 0.001163  ((кВт*год)/(л*С))
try:
    Eколектор
except NameError:
    Eколектор = 0.2
print("Eколектор =",Eколектор, "кВт*год") # Візуалізація енергії колектора
Tколектор = Eколектор *100 # градусів C
print("Tколектор =",Tколектор, "С") # Візуалізація температури колектора
Sколектор = 1 # Вхідна площа колектора , м2
print("Sколектор =",Sколектор, "м2") # Візуалізація плоші колектора
Vколектор = 10 * Sколектор # Обєм колектора в літрах
print("Vколектор =",Vколектор, "л") # Візуалізація обєма колектора
cводи = 0.001163 # ((кВт*год)/(л*С))  Теплоємність води за 1 секунду в кВт*год
maxTколектор = 100
minTколектор = 0
maxEколектор = Vколектор * cводи * (maxTколектор - minTколектор) # Максимальна енергія в колектор від сонця в кВт
print("maxEколектор =",maxEколектор, "максимальної енергії колектора, кВт") # Візуалізація максимальної енергії колектора
Eколектор += dEсонце # Добавка в колектор від сонця
print("Eколектор =",Eколектор, "сумарної енергії колектора, кВт") # Візуалізація сумарної енергії колектора
Kколектор_бак = 1  # Насос між колектором і баком, продуктивність кВт*год 
print("Kколектор_бак =",Kколектор_бак, "продуктивність насосу колектор-бак") # Візуалізація насоса
dEколектор = Eколектор * Kколектор_бак / 3600 # кВт*год в 1 секунду
Tколектор = Eколектор *100 # градусів C
print("Tколектор =",Tколектор, "С") # Візуалізація температури колектора
Eколектор -= dEколектор # Добавка в колектор від сонця
print("Eколектор =",Eколектор, "сумарної енергії колектора, кВт") # Візуалізація сумарної енергії колектора
Tколектор = Eколектор *100 # градусів C
print("Tколектор =",Tколектор, "С") # Візуалізація температури колектора

# Нагрівач
Gнагрівач = 1 # Потужність нагрівача 0 - 10 кВт
print("Gнагрівач",Gнагрівач, "кВт") # Візуалізація енергії нагрівача
Eнагрівач = Gнагрівач * tгод   # Розрахунок енергії нагрівача кВт*год
dEнагрівач = Eнагрівач / 3600 # Розрахунок енергії нагрівача кВт*год за 1 секунду


# Бак
try:
    Eбак
except NameError:
    Eбак = 0.2 
print("Eбак =",Eбак, "кВт*год") # Візуалізація енергії бака
Tбак = Eбак * 100 # градусів C
print("Tбак =",Tбак, "С") # Візуалізація температури бака
maxTбак = 100
minTбак = 0
Vбак = 1000 # Обєм бака в літрах
print("Vбак =",Vбак, "л") # Візуалізація обєма бака
maxEбак = Vбак * cводи * (maxTбак - minTбак)
Eбак += (dEколектор + dEнагрівач) # Розрахунок енергії бака
print("Eбак =",Eбак, "кВт*год") # Візуалізація енергії бака
Kбак_радіатор = 1 # Насос з бака в радіатор
print("Kбак_радіатор =",Kбак_радіатор, "продуктивність насосу бак-радіатор") # Візуалізація насоса
dEбак = Eбак * Kбак_радіатор / 3600 # кВт*год в 1 секунду
Tбак = Eбак * 100 # градусів C
print("Tбак =",Tбак, "С") # Візуалізація температури бака
Eбак -= dEбак # Розрахунок зменшення енергії в баку енергії
print("Eбак =",Eбак, "кВт*год") # Візуалізація енергії бака
Tбак = Eбак * 100 # градусів C
print("Tбак =",Tбак, "С") # Візуалізація температури бака

# Радіатор
try:
    Tдім
except NameError:
    Tдім = 20
print("Tдім =",Tдім, "градуси С") # Візуалізація температури дому
try:
    Eрадіатор
except NameError:
    Eрадіатор = 0.2 
print("Eрадіатор =",Eрадіатор, "сумарна енергія радіатора в кВт*год") # Візуалізація енергії радіатора
maxTрадіатор = 100
minTрадіатор = 0
Vрадіатор = 100 # Обєм бака в літрах
print("Vрадіатор =",Vрадіатор, "л") # Візуалізація обєма радіатора
maxEрадіатор = Vрадіатор * cводи * (maxTрадіатор - minTрадіатор)
Eрадіатор += dEбак # Розрахунок енергії радіатора
print("Eрадіатор =",Eрадіатор, "сумарна енергія радіатора в кВт*год") # Візуалізація енергії радіатора
Tрадіатор = Eрадіатор * 100 # градусів C
print("Tрадіатор =",Tрадіатор, "С") # Візуалізація температури радіатора
Sрадіатор = 1
dрадіатор = 0.01 # (м)
fрадіатор = 0.001 # (кВт/(м*С))
Rрадіатор = dрадіатор / fрадіатор # ((м2*С)/кВт)
dEрадіатор = (Sрадіатор / Rрадіатор) * (Tрадіатор - Tдім) / 3600 # кВт*год за 1 секунду
Eрадіатор -= dEрадіатор # Розрахунок енергії радіатора
print("Eрадіатор =",Eрадіатор, "кВт*год") # Візуалізація енергії радіатора
Tрадіатор = Eрадіатор * 100 # градусів C
print("Tрадіатор =",Tрадіатор, "С") # Візуалізація температури радіатора

# Дім
# c - питома теплоємність повітря  1005 Дж/(кг·°C)
# 1005 / 1000 / 3600 = 0.000279  ((кВт*год)/(л*С))
try:
    Eдім
except NameError:
    Eдім = 0.2 
print("Eдім",Eдім,"сумарна енергія дому в кВт*год") # Візуалізація енергії дому
Tдім = Eдім * 100 # градусів C
print("Tдім =",Tдім, "С") # Візуалізація температури радіатора
Eдім += dEрадіатор # Розрахунок енергії дому
print("Eдім",Eдім,"сумарна енергія дому в кВт*год") # Візуалізація енергії дому
maxTдім = 100
minTдім = 0
Vдім = 10000 # Обєм бака в літрах
print("Vдім =",Vдім, "л") # Візуалізація обєма дому
cповітря = 0.000279 # ((кВт*год)/(л*С))
maxEдім = Vдім * cповітря * (maxTдім - minTдім)
Tдім = Eдім * 100 # градусів C
print("Tдім =",Tдім, "С") # Візуалізація температури радіатора
Sдім = 1
dдім = 0.01 # (м)
fдім = 0.001 # (кВт/(м*С))
Rдім = dдім / fдім # ((м2*С)/кВт)
dEдім = (Sдім / Rдім) * (Tатмосфера - Tдім) / 3600 # кВт*год за 1 секунду
Eдім += dEдім
print("Eдім",Eдім) # Візуалізація енергії дому
Tдім = Eдім * 100 # градусів C
print("Tдім =",Tдім, "С") # Візуалізація температури радіатора
